# pandas的数据结构介绍

## Series

In [91]:
import pandas as pd
import numpy as np

In [6]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [8]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 = pd.Series([4,7,-5,3],index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [11]:
obj2['a']

-5

In [12]:
obj2[['b','c','d']]

b    7
c    3
d    4
dtype: int64

In [13]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [15]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [17]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
states = ['California','Ohio','Oregon','Texas']
obj4 = pd.Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [24]:
obj4.name = 'population'
obj4.index.name = 'state'
# obj4.values.name = 'count'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [25]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [26]:
obj.index = ['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

In [30]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada',],
       'year':[2000,2001,2002,2001,2002],
       'pop':[1.5,1.7,3.6,2.4,2.9]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [31]:
pd.DataFrame(data,columns=['year','state','pop']) #按列排序

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [34]:
frame2 = pd.DataFrame(data,columns=['year','state','pop','debt'],
                      index=['one','two','three','four','five']) 
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [36]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [37]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [38]:
val = pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])
frame2.debt = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [52]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastren  eastern
one    2000    Ohio  1.5   NaN     True     True
two    2001    Ohio  1.7  -1.2     True     True
three  2002    Ohio  3.6   NaN     True     True
four   2001  Nevada  2.4  -1.5    False    False
five   2002  Nevada  2.9  -1.7    False    False

In [56]:
del frame2['pop']
frame2.columns
frame2

       year   state  debt  eastren
one    2000    Ohio   NaN     True
two    2001    Ohio  -1.2     True
three  2002    Ohio   NaN     True
four   2001  Nevada  -1.5    False
five   2002  Nevada  -1.7    False

In [110]:
pop = {'Nevada':{2001:2.4,2002:2.98},
      'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001    2.40   1.7
2002    2.98   3.6

In [58]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4  2.98
Ohio     1.5   1.7  3.60

In [112]:
pd.DataFrame(frame3,index={2001,2002,2003} )

      Nevada  Ohio
2001    2.40   1.7
2002    2.98   3.6
2003     NaN   NaN

In [85]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [82]:
frame2.values

array([[2000, 'Ohio', nan, True],
       [2001, 'Ohio', -1.2, True],
       [2002, 'Ohio', nan, True],
       [2001, 'Nevada', -1.5, False],
       [2002, 'Nevada', -1.7, False]], dtype=object)

In [118]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001     2.40   1.7
2002     2.98   3.6

## 索引对象

In [120]:
obj = pd.Series(range(3),index=['a','b','c'])
obj.index

Index(['a', 'b', 'c'], dtype='object')